In [5]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aadsf\appdata\local\programs\python\python310\lib\site-packages (2.2.9)

In [1]:
import mysql.connector  #importing database
database = mysql.connector.connect(
  host="localhost",
  user="root",
  password=""
)
db = database.cursor() 


db.execute("CREATE DATABASE amrita")

In [2]:
import mysql.connector  #importing database
database = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database='python630'
)

db = database.cursor()

In [4]:
db.execute("SELECT * FROM student")
result =db.fetchall()
result

[(10, 'Sanian', 78, 90, 67, 87, 412, 82.0, 'A'),
 (10, 'Ram', 76, 98, 45, 88, 433, 85.5, 'A'),
 (11, 'Sushant', 76, 98, 45, 88, 433, 85.5, 'A'),
 (14, 'Sushma', 76, 68, 98, 88, 433, 80.5, 'A'),
 (18, 'Radha', 76, 98, 45, 59, 467, 85.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A'),
 (0, '45', 67, 89, 90, 12, 348, 69.6, 'B'),
 (0, '34', 67, 89, 0, 97, 309, 61.8, 'B'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A'),
 (0, 'Rama', 67, 68, 99, 87, 396, 79.2, 'B')]

In [5]:
db.execute("SELECT * From student where name='Ram'")
result=db.fetchall()
result

[(10, 'Ram', 76, 98, 45, 88, 433, 85.5, 'A')]

In [9]:
db.execute("SELECT sn, name,total,per,grade From student")
result=db.fetchall()
result

[(10, 'Sanian', 412, 82.0, 'A'),
 (10, 'Ram', 433, 85.5, 'A'),
 (11, 'Sushant', 433, 85.5, 'A'),
 (14, 'Sushma', 433, 80.5, 'A'),
 (18, 'Radha', 467, 85.5, 'A'),
 (13, '', 423, 89.5, 'A'),
 (13, '', 423, 89.5, 'A'),
 (0, '45', 348, 69.6, 'B'),
 (0, '34', 309, 61.8, 'B')]

In [10]:
db.execute("SELECT * FROM student WHERE grade='A'")
result =db.fetchall()
result

[(10, 'Sanian', 78, 90, 67, 87, 412, 82.0, 'A'),
 (10, 'Ram', 76, 98, 45, 88, 433, 85.5, 'A'),
 (11, 'Sushant', 76, 98, 45, 88, 433, 85.5, 'A'),
 (14, 'Sushma', 76, 68, 98, 88, 433, 80.5, 'A'),
 (18, 'Radha', 76, 98, 45, 59, 467, 85.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A')]

In [11]:
db.execute("SELECT * FROM student WHERE per > 80.0")
result =db.fetchall()
result

[(10, 'Sanian', 78, 90, 67, 87, 412, 82.0, 'A'),
 (10, 'Ram', 76, 98, 45, 88, 433, 85.5, 'A'),
 (11, 'Sushant', 76, 98, 45, 88, 433, 85.5, 'A'),
 (14, 'Sushma', 76, 68, 98, 88, 433, 80.5, 'A'),
 (18, 'Radha', 76, 98, 45, 59, 467, 85.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A'),
 (13, '', 89, 76, 89, 56, 423, 89.5, 'A')]

In [12]:
sql = ''' INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `total`, `per`, `grade`) VALUES ('13', '', '89', '76', '89', '56', '423', '89.5', 'A'); '''
db.execute(sql)
database.commit()

In [6]:
n=int(input("Enter n= "))
for i in range(n):
    name=input("Enter name= ")
    physics=int(input("Enter physics marks= "))
    chemistry=int(input("Enter chemistry marks= "))
    math=int(input("Enter math marks= "))
    english=int(input("Enter english marks= "))
    nepali=int(input("Enter nepali marks= "))
    total=physics+chemistry+math+english+nepali
    per=total/5
    if per >= 80:
        grade ='A'
    elif per > 60:
        grade = 'B'
    elif per > 45:
        grade ='C'
    else:
        grade = 'F'
        
        
    sql = f'''INSERT INTO student (name, physics, chemistry, math, english,
    total, per, grade) VALUES ('{name}', {physics}, {chemistry}, {math}, {english},
    {total}, {per}, '{grade}')'''
    db.execute(sql)
    database.commit()

Enter n= 2
Enter name= pokhrel
Enter physics marks= 56
Enter chemistry marks= 45
Enter math marks= 54
Enter english marks= 45
Enter nepali marks= 46
Enter name= prakash
Enter physics marks= 32
Enter chemistry marks= 23
Enter math marks= 32
Enter english marks= 13
Enter nepali marks= 32

In [ ]:
p